{"format": "graph-model", "generatedBy": "2.0.0-beta1", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_2/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_16/batch_normalization_15/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_3/conv2d_2/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/batch_normalization_14/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_4/conv2d_3/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_5/conv2d_4/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_6/conv2d_5/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_7/conv2d_6/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_8/conv2d_7/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm/Offset", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_9/conv2d_8/Conv2D/merged_input", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack/3", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/stack/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/stack/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/batch_normalization_14/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_16/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_16/conv2d_transpose_7/stack/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_16/batch_normalization_15/FusedBatchNorm/Scaled", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_2/conv2d_1/Conv2D", "op": "Conv2D", "input": ["input_1", "StatefulPartitionedCall/model/sequential_2/conv2d_1/Conv2D/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/sequential_2/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_2/conv2d_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_2/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/model/sequential_3/conv2d_2/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_3/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_3/batch_normalization_2/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_3/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/model/sequential_4/conv2d_3/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_4/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_4/batch_normalization_3/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_4/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/model/sequential_5/conv2d_4/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_5/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_5/batch_normalization_4/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_5/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/model/sequential_6/conv2d_5/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_6/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_6/batch_normalization_5/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_6/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/model/sequential_7/conv2d_6/Conv2D/merged_input"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_7/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_7/batch_normalization_6/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_7/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/model/sequential_8/conv2d_7/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_8/leaky_re_lu_7/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_8/batch_normalization_7/FusedBatchNorm"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/sequential_8/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model/sequential_9/conv2d_8/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_9/leaky_re_lu_8/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/sequential_9/batch_normalization_8/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/sequential_9/leaky_re_lu_8/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/mul", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/mul_1", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/stack", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/sequential_9/leaky_re_lu_8/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Scaled", "StatefulPartitionedCall/model/sequential_10/conv2d_transpose_1/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_10/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/sequential_10/batch_normalization_9/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/sequential_10/re_lu_1/Relu", "StatefulPartitionedCall/model/sequential_8/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/concatenate/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/mul", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/mul_1", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/stack", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/concatenate/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Scaled", "StatefulPartitionedCall/model/sequential_11/conv2d_transpose_2/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_11/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/sequential_11/batch_normalization_10/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/sequential_11/re_lu_2/Relu", "StatefulPartitionedCall/model/sequential_7/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/concatenate_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/mul", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/mul_1", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/stack", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/concatenate_1/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Scaled", "StatefulPartitionedCall/model/sequential_12/conv2d_transpose_3/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_12/re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/sequential_12/batch_normalization_11/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/sequential_12/re_lu_3/Relu", "StatefulPartitionedCall/model/sequential_6/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/concatenate_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/mul", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/mul_1", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/stack", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/concatenate_2/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Scaled", "StatefulPartitionedCall/model/sequential_13/conv2d_transpose_4/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_13/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/sequential_13/batch_normalization_12/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/sequential_13/re_lu_4/Relu", "StatefulPartitionedCall/model/sequential_5/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/concatenate_3/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/strided_slice", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/mul", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/mul_1", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/stack", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/concatenate_3/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Scaled", "StatefulPartitionedCall/model/sequential_14/conv2d_transpose_5/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm", "op": "Add", "input": ["StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Mul", "StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_14/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/sequential_14/batch_normalization_13/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/sequential_14/re_lu_5/Relu", "StatefulPartitionedCall/model/sequential_4/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/model/conv2d_transpose_8/stack/3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/concatenate_4/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_2/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice_1/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/Shape", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_8/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv2d_transpose_8/mul/y", "StatefulPartitionedCall/model/sequential_15/conv2d_transpose_6/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, 